# Sunday hackday

## Globus DSI for gDrive and Box
https://github.com/globus/globus-gridftp-server-google-drive
https://developers.google.com/google-apps/realtime/drive
https://www.globus.org/subscriptions
https://www.globus.org/sites/default/files/160719_Whats_New_in_Globus_XSEDE.pdf
http://www.case.edu/utech/media/caseedu/its-media-library/box/Z_Matrix_Web.pdf
https://icl.cs.utk.edu/projects/rib-globus/
http://toolkit.globus.org/toolkit/docs/4.2/4.2.0/data/gridftp/developer/gridftp-developer-dsi.html
http://toolkit.globus.org/toolkit/docs/latest-stable/gridftp/developer/

## gcloud wg topics
https://www.google.com/search?q=data+studio+google&oq=data+studio+goog&aqs=chrome.0.0j69i57j0l2j69i64.2635j0j7&sourceid=chrome&ie=UTF-8
https://datastudio.google.com/?hl=en#/org//navigation/reporting
https://datastudio.google.com/?hl=en#/org//reporting/0B_U5RNpwhcE6SF85TENURnc4UjA/page/1M
https://www.google.com/search?q=google+firebase&oq=google+firebase&aqs=chrome..69i57j0l5.3251j0j7&sourceid=chrome&ie=UTF-8
https://firebase.google.com/

## alternate editors
https://www.google.com/search?q=vscode&oq=vscode&aqs=chrome..69i57j69i60l2j69i61j69i65j69i59.608j0j7&sourceid=chrome&ie=UTF-8
https://code.visualstudio.com/c?utm_expid=101350005-27.GqBWbOBuSRqlazQC_nNSRg.2&utm_referrer=https%3A%2F%2Fwww.google.com%2F
https://github.com/Microsoft/vscode
https://en.wikipedia.org/wiki/Visual_Studio_Code
https://www.google.com/search?q=spacemacs&oq=spacem&aqs=chrome.0.69i59j69i60j69i57j0l3.1485j0j7&sourceid=chrome&ie=UTF-8
http://spacemacs.org/
https://github.com/syl20bnr/spacemacs
https://twitter.com/spacemacs
http://jr0cket.co.uk/2015/08/spacemacs-first-impressions-from-an-emacs-driven-developer.html
https://github.com/syl20bnr/spacemacs#os-x
https://github.com/syl20bnr/spacemacs/issues/4955
http://www.saltycrane.com/blog/2015/12/switching-emacs-vim-actually-spacemacs/

``` bash
$ brew tap d12frosted/emacs-plus
$ brew install emacs-plus --with-cocoa --with-gnutls --with-librsvg --with-imagemagick --with-spacemacs-icon
$ brew linkapps

$ brew cask install visual-studio-code
```

http://spacemacs.org/doc/QUICK_START.html

## magit triangular workflows
https://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=magit%20triangle%20workflow
https://emacsair.me/2016/01/18/magit-2.4/
https://magit.vc/manual/magit/Branching.html
http://emacs.stackexchange.com/questions/20754/change-the-default-visibility-of-a-magit-section
http://emacs.stackexchange.com/search?q=%5Bmagit%5D+github
http://emacs.stackexchange.com/questions/10153/how-do-i-prevent-magit-from-asking-to-set-upstream-while-pushing/10154#10154
http://emacs.stackexchange.com/questions/13625/viewing-github-prs-in-magit-2-1-0
http://emacs.stackexchange.com/questions/6021/change-a-branchs-upstream-with-magit
http://emacs.stackexchange.com/questions/26426/configure-upstream-for-rebasing-onto-master-in-magit
https://www.reddit.com/r/emacs/comments/2n9tj8/anyone_care_to_share_their_magit_workflow/?st=isp02a5r&sh=9695cff8

## bridges community datasets
https://www.xsede.org/bridges-to-the-future
https://www.psc.edu/index.php/resources-for-users/computing-resources/bridges?id=2049
https://www.google.com/search?q=bridges+%22community+datasets%22&oq=bridges+%22community+datasets%22&aqs=chrome..69i57.2115j0j7&sourceid=chrome&ie=UTF-8
https://www.psc.edu/index.php/bridges-users/user-guide/122-users/computing-resources/bridges/user-guide
https://www.psc.edu/index.php/bridges/users/user-guide/request-community-dataset?view=form
https://portal.xsede.org/web/xup/documentation-overview#access

## wikidata dumps in xml, rdf, and json
https://dumps.wikimedia.org/
https://dumps.wikimedia.org/other/
https://dumps.wikimedia.org/backup-index.html
https://www.wikidata.org/wiki/Wikidata:Database_download
https://www.mediawiki.org/wiki/Wikibase/Indexing/RDF_Dump_Format
http://korrekt.org/page/Introducing_Wikidata_to_the_Linked_Data_Web
http://korrekt.org/papers/Wikidata-RDF-export-2014.pdf
https://dumps.wikimedia.org/wikidatawiki/
https://dumps.wikimedia.org/wikidatawiki/latest/
https://dumps.wikimedia.org/wikidatawiki/entities/
https://dumps.wikimedia.org/wikidatawiki/entities/20160829/

## wikimedia quarry wmflabs and query.wikidata
http://paws.wmflabs.org/paws/user/Aculich/tree#
http://paws.wmflabs.org/paws/user/Aculich/notebooks/yay.ipynb#
http://paws-public.wmflabs.org/paws-public/User:YuviPanda/replicahelper.ipynb
http://paws-public.wmflabs.org/paws-public/User:YuviPanda/NamespaceEdits.ipynb
https://quarry.wmflabs.org/query/runs/all
https://quarry.wmflabs.org/query/3268
https://quarry.wmflabs.org/query/12301
https://quarry.wmflabs.org/query/12271
https://quarry.wmflabs.org/query/runs/all?published=true
https://quarry.wmflabs.org/query/6660
https://quarry.wmflabs.org/query/runs/all?limit=50&from=1511&published=true
https://quarry.wmflabs.org/query/3935
https://quarry.wmflabs.org/query/3163
https://quarry.wmflabs.org/query/11958
https://quarry.wmflabs.org/query/12170
https://quarry.wmflabs.org/query/runs/all?limit=50&from=12163&published=true
https://quarry.wmflabs.org/query/8992
https://quarry.wmflabs.org/query/12303
https://www.wikidata.org/wiki/Q49110
https://www.mediawiki.org/wiki/Manual:Database_layout
https://query.wikidata.org/#%23Cats%0ASELECT%20%3Fitem%20%3FitemLabel%0AWHERE%0A%7B%0A%09%3Fitem%20wdt%3AP2643%20wd%3AQ23334891%20.%20%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20%7D%0A%7D%0A%0AORDER%20BY%20%3Finception
https://query.wikidata.org/#%23Carnegie%20Classification%20of%20Institutions%20of%20Higher%20Education%20doctoral%20university%3A%20higher%20research%20activity%0ASELECT%20%3Fitem%20%3FitemLabel%0AWHERE%0A%7B%0A%09%3Fitem%20wdt%3AP2643%20wd%3AQ23334891%20.%20%0A%20%20%20%20%3Fitem%20wdt%3AP571%20%3Finception%20.%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20%7D%0A%7D%0A%0AORDER%20BY%20%3Finception
https://query.wikidata.org/#%23List%20of%20countries%20ordered%20by%20the%20number%20of%20their%20cities%20with%20female%20mayor%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%28count%28%2a%29%20as%20%3Fcount%29%20%0AWHERE%20%0A%7B%0A%09%3Fcity%20wdt%3AP31%2Fwdt%3AP279%2a%20wd%3AQ515%20.%20%20%23%20find%20instances%20of%20subclasses%20of%20city%0A%09%3Fcity%20p%3AP6%20%3Fstatement%20.%20%20%20%20%20%20%23%20with%20a%20P6%20%28head%20of%20goverment%29%20statement%0A%09%3Fstatement%20ps%3AP6%20%3Fmayor%20.%20%20%20%20%20%23%20...%20that%20has%20the%20value%20%3Fmayor%0A%09%3Fmayor%20wdt%3AP21%20wd%3AQ6581072%20.%20%20%20%20%20%23%20...%20where%20the%20%3Fmayor%20has%20P21%20%28sex%20or%20gender%29%20female%0A%09FILTER%20NOT%20EXISTS%20%7B%20%3Fstatement%20pq%3AP582%20%3Fx%20%7D%20%20%23%20...%20but%20the%20statement%20has%20no%20P582%20%28end%20date%29%20qualifier%0A%09%3Fcity%20wdt%3AP17%20%3Fcountry%20%20%20%23%20Also%20find%20the%20country%20of%20the%20city%0A%20%09%0A%09%23%20If%20available%2C%20get%20the%20%22ru%22%20label%20of%20the%20country%2C%20use%20%22en%22%20as%20fallback%3A%0A%09SERVICE%20wikibase%3Alabel%20%7B%0A%09%09bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20.%0A%09%7D%0A%7D%20%0AGROUP%20BY%20%3Fcountry%20%3FcountryLabel%20%0AORDER%20BY%20DESC%28%3Fcount%29%20%0ALIMIT%20100



``` sql
select *  from page where  page_namespace=0 and page_title='List_of_research_universities_in_the_United_States';
```

``` sparql
#Carnegie Classification of Institutions of Higher Education doctoral university: higher research activity
SELECT ?item ?itemLabel
WHERE
{
    ?item wdt:P2643 wd:Q23334891 .
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}

ORDER BY ?inception
```

``` sparql
#Carnegie Classification of Institutions of Higher Education doctoral university: higher research activity
SELECT ?item ?itemLabel
WHERE
{
    ?item wdt:P2643 wd:Q23334891 .
    ?item wdt:P571 ?inception .
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}

ORDER BY ?inception
```

``` sparql
#  ?city instance of any subclass of city with ?mayor sex or gender female
#  ?city head of government ?statement , ?statement head of government ?mayor , ?city country ?country

#List of countries ordered by the number of their cities with female mayor
SELECT ?country ?countryLabel (count(*) as ?count)
WHERE
{
    ?city wdt:P31/wdt:P279* wd:Q515 .  # find instances of subclasses of city
    ?city p:P6 ?statement .      # with a P6 (head of goverment) statement
    ?statement ps:P6 ?mayor .     # ... that has the value ?mayor
    ?mayor wdt:P21 wd:Q6581072 .     # ... where the ?mayor has P21 (sex or gender) female
    FILTER NOT EXISTS { ?statement pq:P582 ?x }  # ... but the statement has no P582 (end date) qualifier
    ?city wdt:P17 ?country   # Also find the country of the city

    # If available, get the "ru" label of the country, use "en" as fallback:
    SERVICE wikibase:label {
        bd:serviceParam wikibase:language "en" .
    }
}
GROUP BY ?country ?countryLabel
ORDER BY DESC(?count)
LIMIT 100
```

## yuvipanda kubernetes setup
https://github.com/aculich/jupyterhub-simplest-k8s/issues/1
https://github.com/yuvipanda/jupyterhub-simplest-k8s
https://console.cloud.google.com/home/dashboard?project=brc-sandbox
http://danielfrg.com/blog/2016/09/03/jupyterhub-kubernetes-ldap/
http://danielfrg.com/pages/about.html
https://github.com/jupyterhub/jupyterhub
https://github.com/danielfrg/jupyterhub-kubernetes_spawner
https://www.google.com/search?q=helm+kubernetes&oq=helm+kuber&aqs=chrome.0.0j69i57.1629j0j7&sourceid=chrome&ie=UTF-8
https://github.com/kubernetes/helm
https://www.google.com/search?q=minikube&oq=minikub&aqs=chrome.0.0j69i57j0l4.3139j0j7&sourceid=chrome&ie=UTF-8
https://github.com/kubernetes/minikube
https://github.com/kubernetes/minikube/blob/master/DRIVERS.md#xhyve-driver
http://kubernetes.io/docs/getting-started-guides/minikube/

## gcloud persistent disks
https://console.cloud.google.com/compute/instancesDetail/zones/us-central1-f/instances/gke-default-default-pool-5316b0db-5mas?project=brc-sandbox&graph=GCE_CPU&duration=PT1H
https://github.com/aculich/jupyterhub-simplest-k8s/tree/master
https://github.com/aculich/jupyterhub-simplest-k8s/blob/yar-bids-2016-09-02/manifest.yaml
https://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=gce+Standard+persistent+disk+types
https://cloud.google.com/compute/docs/disks/
https://cloud.google.com/compute/docs/disks/add-persistent-disk
https://cloud.google.com/compute/docs/disks/performance
https://cloud.google.com/compute/docs/machine-types
https://cloud.google.com/compute/docs/disks/create-root-persistent-disks
https://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=gcloud%20root%20disk%20ssd
https://cloud.google.com/compute/docs/disks/add-persistent-disk
https://cloud.google.com/compute/docs/disks/
https://cloud.google.com/compute/docs/disks/local-ssd

## gcloud clusters create
https://www.google.com/search?q=gcloud+container+clusters+create&oq=gcloud+container+clusters+create&aqs=chrome..69i57.794j0j7&sourceid=chrome&ie=UTF-8
https://cloud.google.com/sdk/gcloud/reference/container/clusters/create
https://cloud.google.com/container-engine/docs/clusters/operations
https://deis.com/blog/2016/first-kubernetes-cluster-gke/
https://cloudplatform.googleblog.com/2016/05/introducing-Google-Container-Engine-GKE-node-pools.html
http://kubernetes.io/docs/hellonode/
http://kubernetes.io/docs/admin/cluster-management/
https://docs.ansible.com/ansible-container/deploy_kubernetes.html

## yar bids hackday
https://app.google.stackdriver.com/gke/pod/1127283:test-23:9fe1ee65-7152-11e6-a5e2-42010a800053:0f1aadcb-7153-11e6-a5e2-42010a800053
https://github.com/yuvipanda/jupyterhub-simplest-k8s
https://www.google.com/search?q=minikube&oq=minikube&aqs=chrome..69i57j0l5.1500j0j7&sourceid=chrome&ie=UTF-8
https://github.com/kubernetes/minikube
https://asciinema.org/a/5k9vvypms616ceu6yzlsk674e

## asciinema from yar bids hackday
https://github.com/yuvipanda/jupyterhub-remotecsv-authenticator
https://asciinema.org/a/5k9vvypms616ceu6yzlsk674e
https://asciinema.org/a/au1p2ph6fu452p0o1xael1e64
https://github.com/yuvipanda/jupyterhub-simplest-k8s
https://asciinema.org/a/87nte47ur3b988u8vbnjzh5ac
https://github.com/kubernetes/minikube
http://kubernetes.io/docs/user-guide/persistent-volumes/#provisioning
https://github.com/aculich/jupyterhub-simplest-k8s/tree/yar-bids-2016-09-02

## ascinema howto

https://asciinema.org/docs/embedding
https://github.com/asciinema/asciinema.org/issues/171
